practice-for-ch-rails-music-app-long-practice-main/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-03-14 22:03:02.060390"], ["id", 10]]
---
    def reset_session_token
        self.session_token = generate_unique_token
        self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_token
        token = SecureRandom.urlsafe_base64
        while User.exists?(session_token: token)